app/Models/usuariosModel.php

SELECT *
FROM "seguridad"."usuario"
WHERE "usuario" = 'ADMIN'
AND "clave" = 'Satur.2332.'
---
    public function obtenerUsuario($p_usuario,$p_password){

        $usuario=$this->db->table("seguridad.usuario");
        $usuario->where(['usuario'=>$p_usuario,'clave'=>$p_password]);
        return $usuario->get()->getResultArray();

SELECT *
FROM "registro"."psector"
---
    public function obtenerSectores(){

        $sql=$this->db->table("registro.psector");
        return $sql->get()->getResultArray();